/**
 * mock拦截 采集员信息比对的数据 comparison.html
 * author: wang bin
 */
// Random.integer( min, max )
// Mock.Random.integer(60, 100)
// Mock.mock('@integer(60, 100)')

Mock.mock('/getData', {
  levelData: [
    {name: '臧海彬', level: '甲级'},
    {name: '刘威', level: '乙级'},
    {name: '刘德华', level: '乙级'},
    {name: '马涛', level: '丙级'}
  ],
  radarData: {
    columns: ['成员', '总信息量', '异议/申诉数量', '镇排名情况', '村排名情况', '周信息量'],
    rows: [
      {'成员': '臧海彬', '总信息量': 1393, '异议/申诉数量': 1093, '镇排名情况': 21, '村排名情况': 23, '周信息量': 623},
      {'成员': '刘威', '总信息量': 3530, '异议/申诉数量': 3230, '镇排名情况': 44, '村排名情况': 22, '周信息量': 1421},
      {'成员': '刘德华', '总信息量': 2923, '异议/申诉数量': 2623, '镇排名情况': 33, '村排名情况': 42, '周信息量': 4213},
      {'成员': '马涛', '总信息量': 1923, '异议/申诉数量': 3623, '镇排名情况': 23, '村排名情况': 12, '周信息量': 4213}
    ]
  },
  infoRatio: [
    {name: '臧海彬', ratio: 82, color: '#60b8f6'},
    {name: '刘威', ratio: 78, color: '#facc14'},
    {name: '刘德华', ratio: 45, color: '#55da8d'},
    {name: '马涛', ratio: 30, color: '#ce84de'},
  ],
  lineData: {
    columns: ['日期', '臧海彬', '刘威', '刘德华', '马涛'],
    'rows|12': [
      {
        '日期|+1': ['3.30', '3.31', '4.01', '4.02', '4.03', '4.04', '4.05', '4.06', '4.07', '4.08', '4.09', '4.10'],
        '臧海彬': '@integer(0, 100)',
        '刘威': '@integer(0, 100)',
        '刘德华': '@integer(0, 100)',
        '马涛': '@integer(0, 100)'
      }
    ]
  },
  infoData: {
    columns: ['信息类别', '人均信息量', '累计采集总数量', '周采集总数量', '本村采集员排名', '本镇采集员排名'],
    rows: [
      ['臧海彬', 1393, 1093, 21, 23, 623],
      ['刘威', 3530, 3230, 44, 22, 1421],
      ['刘德华', 2923, 2623, 33, 42, 4213],
      ['马涛', 1923, 3623, 23, 12, 4213]
    ]
  }
})
